Repository: krompert/darkside
Catalog: birthdays/locales/*.po
Languages: fr

source: Announces people's birthdays and gives them a birthday role for the whole UTC day
fr: Annonce l'anniversaire des personnes et leur donne un rôle d'anniversaire pendant un jour UTC complet

source: Birthday List
fr: Liste d'anniversaires

source: <@!{}> is now **{} years old**. :tada:
fr: <@!{}> a maintenant **{} ans**. :tada:

source: It's <@!{}>'s birthday today! :tada:
fr: C'est l'anniversaire de <@!{}> aujourd'hui! :tada:

source: :white_check_mark: The birthday role on **{g}** has been set to: **{r}**.
fr: :white_check_mark: Le rôle d'anniversaire sur le serveur **{g}** est maintenant: **{r}**.

source: :x: The birthday date you entered is invalid. It must be `MM-DD`.
fr: :x: La date d'anniversaire que vous avez entrée est invalide. Ça doit être `MM-JJ`.

source: :white_check_mark: Your birthday has been set to: **{}**.
fr: :white_check_mark: Votre anniversaire est maintenant le **{}**.

source: :white_check_mark: The channel for announcing birthdays on **{g}** has been set to: **{c}**.
fr: :white_check_mark: Le salon d'annonce des anniversaires sur le serveur **{g}** est maintenant: **{c}**.

source: :put_litter_in_its_place: Your birthday has been removed.
fr: :put_litter_in_its_place: Votre date d'anniversaire a été retirée.

source: Birthday settings
fr: Paramètres d'anniversaire

source: Sets the birthday announcement channel for this server
fr: Définis le salon d'annoncement des anniversaires pour ce serveur

source: Sets the birthday role for this server
fr: Définis le rôle d'anniversaire pour ce serveur

source: Unsets your birthday date for this server
fr: Retire votre date d'anniversaire

source: Sets your birthday date for this server The given date must be given as: MM-DD Year is optional. If ungiven, the age won't be displayed.
fr: Ajoute votre date d'anniversaire La date donnée doit suivre le format: MM-JJ L'année est optionnelle. Si elle n'est pas donnée, l'âge ne sera pas affiché.

source: Lists the birthdays for this server If a user has their year set, it will display the age they'll get after their birthday this year
fr: Liste les anniversaires Si un utilisateur a son année définie, affiche l'âge qu'il aura après son anniversaire cet année
